{
  "title": "High Pressure Jet Washer DJ-200",
  "images": [
      "/Product/Jet-washer/DJ-200/1.png",
      "/Product/Jet-washer/DJ-200/2.png",
      "/Product/Jet-washer/DJ-200/3.png"
  ],
  "specifications": [
[
  { "label": "Pressure", "value": "170 Bar" },
  { "label": "Flow Rate", "value": "17 L/Min" },
  { "label": "Fuel", "value": "Diesel" },
  { "label": "Power", "value": "5.5 kW" },
  { "label": "Voltage", "value": "NA" },
  { "label": "Speed", "value": "3400 rpm" }],[
  { "label": "Weight", "value": "70 Kg" },
  { "label": "Water Tank", "value": "200L" },
  { "label": "Working Time", "value": "NA" },
  { "label": "Product Size", "value": "1200x900x1400 mm" },
  { "label": "Hose Length", "value": "15m" },
  { "label": "Wire Length", "value": "NA" }
]



  ],
  "youtubeVideoId": "jD2pVtdJbQs",
  "contactLink": "/contact",
  "catalogLink": "/catalogue/high_pressure_jet_washer/DJ-200.pdf",
  "descriptionTitle": "Overview",
  "description": "If cleaning becomes too difficult when the need for cleaning is urgent, or when the cleaning gets too intense, the DJ-200 comes in. This diesel-powered <a href=\"/products/high-pressure-jet-washer/battery-DJB-200\" target=\"_blank\" style=\"color: #6f73d6; \">high-pressure jet cleaner</a> offers pure power and industrial performance whenever you require it, equipped with 170 bar of pressure and a 17 L/min flow speed and an integrated 200-liter reservoir of water, and a 200-liter water tank all in one rugged, mobile unit.Created to be completely independent of the power grid or water lines The DJ-200 is the ideal cleaning solution for jobsites that are remote sites, construction zones big equipment warehouses, as well as farms. Simply fuel it up and blast away -it's ready to blast away mud cement, grease, oil and industrial dirt effortlessly.Whether you're washing equipment or clearing roads, or managing fleets, the DJ-200 provides the optimal combination of portability, power, and efficiency.",
"keyFeatures": [
  "170-Bar High Pressure Output – Gets rid of the hardest dirt, debris, and grease with industrial-grade force.",
  "17 L/min Water Flow – Cleans large surfaces quickly, saving time without compromising on cleanliness.",
  "200-Liter Built-In Water Tank – Allows continuous cleaning without needing a direct water connection.",
  "Powerful Diesel Engine – Operates anywhere, anytime without electricity—ideal for off-grid environments.",
  "Heavy-Duty Industrial Construction – Reinforced chassis, durable wheels, and a weather-proof body built for harsh conditions.",
  "Continuous Operation – Designed for extended run times, making it ideal for daily industrial use.",
  "User-Friendly Design – Ergonomic controls, clear pressure gauges, and hose storage for easy operation and maintenance.",
  "All-Terrain Cleaning Capability – Perfect for construction zones, transport hubs, farms, and remote sites requiring rugged independence."
]



}
