{
  "title": " Single Disc Scrubber D-25P ",
  "images": [
    "/Product/Single-Disc-Scrubber/D-25P/1.png",
    "/Product/Single-Disc-Scrubber/D-25P/2.png",
    "/Product/Single-Disc-Scrubber/D-25P/3.png",
    "/Product/Single-Disc-Scrubber/D-25P/4.png"
  ],
  "specifications": [
    [
      { "label": "Power", "value": "2.5 Hp" },
      { "label": "Brush Size", "value": "430mm" },
      { "label": "Water Tank", "value": "10L" },
      { "label": "Voltage", "value": "220V" }
    ],
    [
      { "label": "Brush Speed", "value": "175 rpm" },
      { "label": "Brush Pressure", "value": "60Kg" },
      { "label": "Weight", "value": "68Kg" },
      { "label": "Wire Size", "value": "12 m" },
      { "label": "Size", "value": "560x480x1230 mm" }
    ]
  ],
  "youtubeVideoId": "EbMqT2J50lc",
  "contactLink": "/contact",
  "catalogLink": "/catalogue/single_disc_scrubbers/D-25P.pdf",
  "descriptionTitle": "Overview",
  "description": "The D-25P is a <a href=\"/products/Single-disc-scrubber/D-15P\" target=\"_blank\" style=\"color: #6f73d6; \">Single Disc scrubber</a>, commercial-grade heavy-duty mop scrubber. It cleans, polishes and maintains every type of floor surface. It can be effortlessly operated due to the high level motor, ease of use, push down cleaning, deep cleaning of brushes and scrubbers, and just like the other features in this scraper, it's range, is really good, and exceeds standards for such equipment. The high-spec professional scrubber successfully flexes its power. Industrial Grade 2.5 HP Motor, 175 RPM Rotary Speed, Cleans all surfaces.",

  "keyFeatures": [
    "The D-25P will clean really well and thoroughly the D-25P will clean quite considerably and effectively with 2.5 HP motor and 175 RPM scrub brush.",
    "The flexible operation with an adjustable handle allows the D-25P to operate effortlessly, providing better control.",
    "Built-in Water Tank with 10L onboard water tank for not stopping cleaning continuously",
    "Just plug in with the 12 meter power cord and you can walk around freely with no restrictions to various sockets.",
    "D-25P 60 KG brush pressure give the machine an edge in deeply cleans stains ensuring an effective cleaning.",
    "The D-25P has tough components that assure reliability in industrial capacity, durability, powerful performance, and requires little effort on your part.",
    "Most effective in multiple environments, particularly in commercial spaces, malls, hospitals, hotels, and for industrial cleaning.",
    "Equipped with high-performance brushes and a durable build for effortless floor maintenance."
  ]
}
