{
  "title": "Sweeper Truck DTMS-6000 ",
  "images": [
      "/Product/Munciple-Deisal-sweeper-Truck/DTMS-1000/1.png",
      "/Product/Munciple-Deisal-sweeper-Truck/DTMS-6000/1.png",
      "/Product/Munciple-Deisal-sweeper-Truck/DTMS-6000/2.png"

  ],
  "specifications": [

    [
  { "label": "Chassis", "value": "16 Ton" },
  { "label": "Hopper Capacity", "value": "6.5 m³" },
  { "label": "Auxiliary Engine", "value": "110 Hp" },
  { "label": "Rotary Brush", "value": "2x 500mm" },
  { "label": "Main Brush", "value": "1900mm" },
  { "label": "Main Brush Dia", "value": "381mm" },
  { "label": "Sweeping Width", "value": "3000mm" },
  { "label": "Working Speed", "value": "2.0-15.5 km/h" }],[
  { "label": "Water Tank", "value": "500L" },
  { "label": "Dust Tank", "value": "26000 m²/h" },
  { "label": "Vacuum Hose", "value": "5m" },
  { "label": "Hose Dia", "value": "150mm" },
  { "label": "High Pressure Jet Washer", "value": "Yes" },
  { "label": "Auxiliary Engine Fuel", "value": "Diesel (Turbo)" },
  { "label": "Recommended Chassis", "value": "TATA ULTRA" }
]





  ],
  "contactLink": "/contact",
  "catalogLink": "/catalogue/municipal_sweeper/DTMS-6000.pdf",
  "descriptionTitle": "Overview",
  "description": "The DTMS-6000 <a href=\"/products/battery-operated-sweeper-truck\" target=\"_blank\" style=\"color: #6f73d6; \">Sweeper Truck</a> is a highly efficient road-cleaning machine that is powered by a powerful diesel engine. Particularly designed for large-scale clean-up projects, this sweeper truck is suitable for roads that are municipal, highways industrial zones, and construction sites. With its large sweeping area and high-suction vacuum system and water sprayer with precision controlled the DTMS-6000 is guaranteed to provide efficient removal of debris, dust and waste in a single seamless process.</br></br> The diesel sweeper truck comes equipped with a large capacity waste bin, a litter picker integrated and a longer fuel autonomy, which makes it the ideal vehicle for sanitation in cities. The robust chassis, the operator-friendly cabin, and sophisticated control system guarantee safety, comfort and efficiency throughout every cleaning process.</br></br> This DTMS-6000 <a href=\"/products/battery-operated-sweeper-truck/DRS-600\" target=\"_blank\" style=\"color: #6f73d6; \">sweeper truck</a> is a popular option in Swachh Bharat Mission, Smart City Projects as well as urban sanitation contracts. It delivers the most powerful cleaning power and long-term efficiency for cities of the future.",
"keyFeatures": [
  "High-Capacity Water & Dust Tanks – 100L water and 1000L dust collection for extended operation.",
  "Powerful Performance – Best performance in heavy-duty sweeping operations, as it utilizes high torque from the diesel engines.",
  "Long Operating Range – Able to run for several hours continuously without frequent refuels.",
  "Integrated Litter Picker – Enhanced efficiency along edges and corners of curbs for the easy collection of larger forms of litter such as wrappers and bottles.",
  "High Suction Capacity – Efficiently lifts dust, gravel, leaves, and plastic litter from roads.",
  "Large Waste Hopper – Less operational pauses bringing increased efficiency by decreasing the need for frequent unloads.",
  "Strong Water Spraying System – Improves cleaning quality by reducing airborne dust while cleaning.",
  "Tough Conditions Are No Problem – Functions properly in any weather or terrain.",
  "Best For City Use – Best suited for major roads, urban roads, and large industrial cities."
],
"why_choose_us": "Selecting the Dynaclean <a href=\"/products/sweeper\" target=\"_blank\" style=\"color: #6f73d6; \">Sweeper truck</a> is investing in durability, reliability, and cutting-edge cleaning technology. It is designed for extended hours of use, the DTMS-6000 guarantees maximum efficiency and minimal downtime, making it the perfect for industrial and city cleaning. The DTMS-6000's sophisticated dust filtration system makes for a an environment that is healthier and cleaner as well as the ergonomic design of the cabin ensures that the user is comfortable even on long shifts. Constructed to endure tough Indian weather and road conditions, this <a href=\"/products/battery-operated-sweeper-truck/DTMS-6000\" target=\"_blank\" style=\"color: #6f73d6; \">sweeper truck</a>  provides steady performance year after year. With Dynaclean industry and municipalities benefit more than an equipment, they gain a reliable partner to maintain clean, more intelligent, and more sustainable cities.",

"choose_title": "Why Choose a Dynaclean Sweeper Truck?"





}
