{
  "title": "Ride on Scrubber Drier DRO-200T",
  "images": [
      "/Product/Auto-Scrubber-Drier/DRO-200T/1.png",
      "/Product/Auto-Scrubber-Drier/DRO-200T/2.png"
  ],
  "specifications": [
[
  { "label": "Clean Water Tank ", "value": "200 L" },
  { "label": "Waste Water Tank", "value": "220 L" },
  { "label": "Scrubbing Width", "value": "560 x 2 mm" },
  { "label": "Squeegee Width", "value": "1250 mm" },
  { "label": "Cleaning Efficiency", "value": "10000 m²/h" },
  { "label": "Battery Capacity/Wire Size", "value": "100 Ah/m" },
  { "label": "Voltage", "value": "24 V" }
],[
  { "label": "Brush/Suction Motor Power", "value": "500 x 2 / 650 W" },
  { "label": "Drive Motor", "value": "1200 W" },
    { "label": "Water Gun Motor", "value": "120" },
  { "label": "Size", "value": "1640 x 1250 x 1440 mm" },
  { "label": "Weight", "value": "280 kg" },
  { "label": "Working Time", "value": "3.0 - 4.0 hours" }
]

  ],
  "youtubeVideoId": "LP-euKsfJ_g",
  "contactLink": "/contact",
  "catalogLink": "/catalogue/ride_on_scrubber_driers/DRO-200T.pdf",
  "descriptionTitle": "Overview",
  "description": "The DRO-200T is Dynaclean industries most powerful and fully battery-operated ride-on scrubber drier, purpose-built for large scale industrial and commercial floor scrubbing machine. Engineered with advanced scrubbing technology, user-friendly controls and durable components, it ensures maximum cleaning coverage, operator safety, and low-maintenance performance. With a massive dual-tank system and motor configuration, this <a href=\"/products/scrubber-drier/DMOP-15P\" target=\"_blank\" style=\"color: #6f73d6; \">ride on scrubber machine</a> is ideal for hospitals, airports, and such as parking and train stations etc.",
"keyFeatures": [
  "Outstanding cleaning coverage this scrubber drier can clean areas as large as 10000m square/hour.",
  "Tank Capacity this floor scrubber machine has 200L of clean water capacity, 220L waste tank.",
  "best quality of material for any conditions and durable build quality of bush and scrubber for continued use.",
  "Flexible Uses this scrubber drier is ideal for hospitals, airports, and such places as parking and train stations.",
  "Enhanced Advanced Cleaning Features deep scrubbing, and rapid drying capabilities.",
  "DRO-200T floor scrubber drier delivers unmatched heavy-duty cleaning performance with its 1250 mm wide scrubber.",
  "DRO-200T works without noise and is ideal for use in noise-sensitive places like hospitals, hotels, offices, and public facilities.",
  "Built with durability and simplicity in mind, it comes with a robust 10mm thick body and easily accessible parts for minimum maintenance needs."
]




}
