{
  "title": "Ride on Scrubber Drier DRO-100T",
  "images": [
      "/Product/Auto-Scrubber-Drier/DRO-100T/1.png"
  ],
  "specifications": [
[
  { "label": "Clean Water Tank ", "value": "90 L" },
  { "label": "Waste Water Tank ", "value": "100 L" },
  { "label": "Scrubbing Width", "value": "350 x 2" },
  { "label": "Squeegee Width", "value": "920 mm" },
  { "label": "Cleaning Efficiency", "value": "4900 m²/h" },
  { "label": "Battery Capacity/Wire Size", "value": "100 Ah/m" },
  { "label": "Voltage", "value": "24 V" }
],[
  { "label": "Brush/Suction Motor Power", "value": "380 x 2 / 500 W" },
  { "label": "Drive Motor", "value": "500 W" },
  { "label": "Water Gun Motor", "value": "120" },
  { "label": "Size", "value": "1460 x 1030 x 1110 mm" },
  { "label": "Weight", "value": "190 kg" },
  { "label": "Working Time", "value": "3.0 - 4.0 hours" }
]

  ],
  "youtubeVideoId": "kgIR3_ADlhE",
  "contactLink": "/contact",
  "catalogLink": "/catalogue/ride_on_scrubber_driers/DRO-100T.pdf",
  "descriptionTitle": "Overview",
  "description": "The Dynaclean Industries Ride On Scrubber Machine DRO-100T is an advanced, high-performance cleaning solution engineered for large commercial, industrial, and public spaces. Designed with smart technology and industrial-grade components, this ride on scrubber machine ensures deep, efficient, and intelligent cleaning for even the most demanding environments. Equipped with powerful scrubbing motors and a durable build, the DRO-100T Ride On Scrubber Machine delivers exceptional cleaning results while maintaining ease of use and operator comfort. Its intelligent control system allows precise adjustments, ensuring every floor type — from warehouses to malls and airports — is cleaned with maximum efficiency and safety. This ride on scrubber machine combines advanced performance, ergonomic design, and reliability to achieve higher cleaning productivity with reduced labor and maintenance costs. Whether you’re managing large areas or daily cleaning operations, the DRO-100T offers superior results every time.",
"keyFeatures": [
  "Outstanding cleaning coverage this scrubber drier can clean areas as large as 4,900 m squared/hour.",
  "Flexible Uses the floor scrubber machine is optimal for use in busy areas like warehouses, malls, airports, industrial plants, etc.",
  "Strong dual brush system equipped with a dual 380W brush motor, deep scrubbing is now easier at all surfaces.",
  "Large-capacity tanks for uninterrupted cleaning with a clean tank of 90L and waste tank of 100L.",
  "Efficient Sewage Management the built-in portable sewage system enables the quick and hygienic disposal of dirty water.",
  "Heavy-Duty Cleaning Performance DRO-100T is comes with 750x2mm scrubbing width, dual 380x2W brush motors built to handle demanding cleaning tasks with ease.",
  "DRO-100T Squeegee is built from high-durability rubber with excellent wear resistance",
  "DRO-100T scrubber drier fully battery-operated and gives the working time of up to 3 hours of continuous operation."
]




}
