{
  "title": "Ride On Sweeper DRS-180T",
  "images": [
    "/Product/Sweeper/DRS-180T/1.png",
    "/Product/Sweeper/DRS-180T/2.png",
    "/Product/Sweeper/DRS-180T/3.png",
    "/Product/Sweeper/DRS-180T/4.png"
  ],
  "specifications": [
    [
      {
        "label": "Clean Water Tank",
        "value": "160 L"
      },
      {
        "label": "Waste Water Tank",
        "value": "180 L"
      },
      {
        "label": "Sweeping Width",
        "value": "1550 mm"
      },
      {
        "label": "Main Brush Width",
        "value": "790 x 300 mm"
      },
      {
        "label": "Side Brush Width",
        "value": "2 x 500 mm"
      },
      {
        "label": "Cleaning Efficiency",
        "value": "13000 m²/h"
      },
      {
        "label": "Battery Capacity",
        "value": "65 x 4 Ah"
      },
      {
        "label": "Working Time",
        "value": "3.0 - 4.0 hours"
      }
    ],
    [
      {
        "label": "Voltage",
        "value": "48 V"
      },
      {
        "label": "Brush/Suction Motor",
        "value": "600/2 x 90 W"
      },
      {
        "label": "Drive Motor",
        "value": "2200 W"
      },
      {
        "label": "Side Brush Motor",
        "value": "90 x 2 W"
      },
      {
        "label": "Weight",
        "value": "570 kg"
      },
      {
        "label": "Size",
        "value": "1920 x 1550 x 1350 mm"
      }
    ]
  ],
  "youtubeVideoId": "I9TjZhxPAQ0",
  "contactLink": "/contact",
  "catalogLink": "/catalogue/sweepers/DRS-180T.pdf",
  "descriptionTitle": "Overview",
  "description": "Dynaclean Industries proudly presents the <a href=\"https://dynacleanindustries.com/products/sweeper/ride-on-sweeper-DRS180T\" target=\"_blank\" style=\"color: #6f73d6;\">Ride On Sweeper DRS-180T</a>, a potent and dependable cleaning-system that is specifically built to handle heavy industrial and commercial areas of the market. The DRS-180T, a <b>Best Sweeper Machine</b> choice class award-winning model, represents an ideal blend of durability and advanced technology, enabling the user to produce cleaner, safer, and less dusty environments with minimum effort.<br><br>This innovative ride on sweeper is the ultimate solution for cleaning large floor spaces in manufacturing plants, storage facilities, parking structures, airports, industrial complexes, and city roads. In addition to its spacious hopper, the <b>DRS-180T</b> also features the most powerful suction and widest sweeping path that, together, can make the work go twice as fast and require half the effort. Moreover, the comfortable operator-friendly seat paired with the simple-to-use controls allow easy handling even in tight spaces and heavy-duty type of cleaning.<br><br>The <a href=\"https://dynacleanindustries.com/products/sweeper/ride-on-sweeper-DRS180T\" target=\"_blank\" style=\"color: #6f73d6;\">Sweeper Machine</a>, designed to endure harsh conditions, is a wise purchase for companies that are committed to increasing their productivity, keeping their areas clean, and saving money in the long run.<br><br>Dynaclean Industries is a company where we go beyond the ordinary to bring you the best in performance and reliability. The Ride On Sweeper DRS-180T is the embodiment of great performance—cleaning the future, one sweep at a time.",
  "keyFeatures": [
    "<b>Eco-Conscious Performance</b> - Operators have the option of choosing between electrically and battery-powered models that ensure zero emissions of exhaust gases, aligning with sustainable industrial and urban cleaning goals",
    "<b>Economical Productivity</b> - The <a href=\"/products/municipal-diesel-sweeper-truck/DTMS-1000\" target=\"_blank\" style=\"color: #6f73d6; \">Ride on Sweeper</a> outperforms both manual units and diesel-powered alternatives, significantly reducing maintenance and fuel expenses while speeding up task completion",
    "<b>Low-Volume Operation</b> - The latest noise reduction technologies allow for use in sensitive areas like healthcare facilities, educational institutions, corporate campuses, and residential areas without creating disturbance",
    "<b>Streamlined Manoeuvrability</b> - Constructed to maneuver precisely in tight aisles and densely stacked warehouses, the Ride on Sweeper efficiently maximizes its sweeps",
    "<b>Comprehensive Cleaning Performance</b> - An integrated high-capacity brush and vacuum system ensures the complete removal of dust, falling leaves, construction waste, and soil adhesion, resulting in flawless flooring surfaces",
    "<b>Operator-Centric Cabin Controls</b> - The cabin features ergonomic geometry and easy-to-reach ride on controls, enhancing operator comfort, reducing fatigue, and boosting overall efficiency",
    "<b>Versatile Surface Applicability</b> - Designed for use in various environments such as industrial concrete roads, parking surfaces, warehousing, and retail settings, the Ride on Sweeper adapts easily to different cleaning conditions",
    "<b>Controlled Dust Suppression</b> - An integrated water-spray device prevents airborne particulates during sweeps, leading to improved air quality",
    "<b>Prolonged Runtime</b> - The battery-operated version offers longer cleaning cycles on a full charge with minimal maintenance required"
  ],
  "why_choose_us": "The Dynaclean <a href=\"/products/sweeper/manual-sweeper-DS255\" target=\"_blank\" style=\"color: #6f73d6; \">Ride on Sweeper </a> blends smart cleaning technology, tangible cost savings, and minimal environmental footprint. Excellent operational performance, top ergonomics for operators, and energy-efficient technology make it the best choice for industry retail, municipal, as well as industrial applications.The Dynaclean range includes commercial, industrial, complete electric and <a href=\"/products/sweeper/manual-sweeper-DSE55\" target=\"_blank\" style=\"color: #6f73d6; \">Ride on Sweeper </a> equipment designed to meet the exact requirements of modern-day cleaning environments.",
  "choose_title": "Why Choose Dynaclean Ride On Sweeper?"
}