{
  "companyName": "DYNACLEAN INDUSTRIES",
  "documentTitle": "CODE OF CONDUCT",
  "documentSubtitle": "FOR EMPLOYEES AND OFFICERS",
  "versionInfo": "2025 | Rev:00",
  "preamble": {
    "title": "I. PREAMBLE",
    "content": "DYNACLEAN INDUSTRIES is a professionally managed Private Limited Company, committed to total customer satisfaction & enhancing stakeholders’ value. The Company’s philosophy on corporate governance is built on a rich legacy of fair & transparent governance & disclosure practices. This includes respect for human values, individual dignity, & adherence to honest, ethical & professional conduct. “DYNACLEAN INDUSTRIES” are guided by the vision statement & values mentioned therein for the success & reputation of DYNACLEAN INDUSTRIES."
  },
  "applicability": {
    "title": "II. APPLICABILITY",
    "content": "This Code of Conduct is applicable to all Supervisory, Executive, Covenanted, officers and equivalent grades of DYNACLEAN INDUSTRIES PRIVATE LIMITED and its group of Companies. The Board Members, Executive Directors and Senior Managerial Personnel (Senior Officers) will continue to be governed by the Code of Conduct signed by them."
  },
  "codeOfConduct": {
    "title": "III. CODE OF CONDUCT",
    "sections": [
      {
        "id": "honesty-integrity-ethics",
        "heading": "i). Honesty, Integrity & Ethics",
        "content": "All DYNACLEAN INDUSTRIES shall act in conformity with professional standards of personal integrity, honesty & ethical conduct, especially when on Company’s business, at Company sponsored events, or when representing the Company. Ethical conduct is one that is free from fraud & deception and includes actual or potential conflicts of interest between personal advantages as against organization’s needs and/or values."
      },
      {
        "id": "respect-for-individuals",
        "heading": "ii). Respect for Individuals",
        "content": "Our success can be achieved only when we treat everyone, both within and outside our Company, with respect. Respect in the workplace, along with individual excellence and collaborative teamwork, is how we will accomplish our goals. DYNACLEAN INDUSTRIES shall treat their colleagues & business associates with dignity & respect, irrespective of caste, creed, gender, religion/region, nationality, appearance or any disability. Superiors shall encourage their subordinates/colleagues to express their professional views in meetings / discussions, candidly and without fear. Feedback on performance will be provided as far as possible in private. They shall treat them with equity & fairness. DYNACLEAN INDUSTRIES shall not use abusive or offensive language, tone or gesture with their colleagues or business associates. Superiors shall not insult/demean their subordinates. DYNACLEAN INDUSTRIES shall commit to create an environment which is free of any type of sexual harassment & abide by the Policy for Protection of Women’s Rights at the Workplace. Every employee shall strive to protect women employees from any act of sexual harassment. The Provisions of the relevant law, rules and norms regarding the Sexual Harassment of Women at Workplace have become contextually very relevant in today’s time. It is very important for every male employee to exercise diligence in drawing the line with respect to professional interactions with female employees. Maintaining decorum and ensuring that the employee is not exposed to complaints is important, for which it is the responsibility of each male employee to be fully aware of the provisions of the relevant law and repercussions of violations. It is the responsibility of the employee concerned to familiarize himself with the relevant law as applicable."
      },
      {
        "id": "customer-need-and-stakeholder-value",
        "heading": "iii). Customer Need and Stakeholder Value",
        "content": "DYNACLEAN INDUSTRIES is passionate about meeting customers’ needs and delivering to stakeholders. DYNACLEAN INDUSTRIES shall:\n\n- Demonstrate a passion for understanding and meeting the needs of customers and stakeholders\n- Shall be fair, professional and transparent in its dealings with the customers and stakeholders.\n- Take active responsibility for the quality of service we provide to customers and stakeholders\n- Are open to change and readily implement better ways of doing things\n- Have high performance expectations and a mindset of excellence\n- be innovative in identifying new opportunities and approaches for our customers, stakeholders and ourselves\n- respect customers’ right to privacy in relation to their personal data\n- Comply with all data privacy laws that prescribe how to responsibly collect, store, use, share, transfer and dispose of personal information, and strive to comply with those laws everywhere the Company operates."
      },
      {
        "id": "fair-competition-and-anti-trust",
        "heading": "iv). Fair Competition and Anti-trust",
        "content": "Company believes fair and open competition benefits customers, stakeholders, and society as a whole. Company supports the development and operation of competitive open markets and the liberalisation of trade and investment in each country and market in which we operate. DYNACLEAN INDUSTRIES shall not enter into any activity constituting anti-competitive behavior such as abuse of market dominance, collusion, participation in cartels or inappropriate exchange of information with competitors. DYNACLEAN INDUSTRIES shall collect competitive information only in the normal course of business and obtain the same through legally permitted sources and means."
      },
      {
        "id": "sharing-of-official-information",
        "heading": "v). Sharing of Official Information",
        "content": "DYNACLEAN INDUSTRIES shall not divulge or communicate in any manner sensitive/confidential information to third parties, except when authorized to do so for business reasons. Company’s Policy Guideline on Designated Spokespersons authorized for communicating to the media in this regard, shall be strictly followed. DYNACLEAN INDUSTRIES shall not speak ill about the organization to any external agency which would tarnish the image of the organization. Similarly, DYNACLEAN INDUSTRIES shall desist from indulging in rumor mongering/loose talks, about the organization that is detrimental to the Company’s interest."
      },
      {
        "id": "maintaining-confidentiality",
        "heading": "vi). Maintaining Confidentiality",
        "content": "In addition to the above, the employees shall maintain the integrity of internal communications. Care shall be taken to mitigate various risks emanating out of communication such as misrepresentation of facts/ events, leakage of price sensitive information, unfavorable reports on developments in the Company and inconsistent communication at the times of crisis. The contents of all the internal & external communications shall conform to the guidelines of Communication Risk Management Policy issued jointly by the Corporate Brand Management & Communication Department and Corporate Risk Management. The employees and personnel of DYNACLEAN INDUSTRIES Group may in the course of their employment and engagement, become aware of and possess information of DYNACLEAN INDUSTRIES Group or third parties disclosed to the DYNACLEAN INDUSTRIES Group that is not generally known. This may include information which if disclosed could jeopardize the interests of the DYNACLEAN INDUSTRIES Group. Hence as per the Confidentiality policy, all the employees have been entrusted with the duty to keep such information strictly confidential and use it only for proper purposes in accordance with the law. This would apply during the course of employment as well as post separation."
      },
      {
        "id": "dealing-in-securities",
        "heading": "vii). Dealing in Securities While in Possession of Unpublished Price Sensitive Information (UPSI)",
        "content": "Every employee will be considered as an ‘INSIDER’ under the provisions of the SEBI (Prohibition of Insider Trading) Regulations, 2015 as amended in 2018. As an Insider, it is the duty of the employee not to deal in or advocate trade in securities (eg. equity shares / preference shares / derivatives) of the Company when in possession of any UPSI and till such time the information comes in the public domain. The onus will be on the employee to demonstrate that he / she was not in possession of UPSI at the time of dealing in securities."
      },
      {
        "id": "professional-engagement",
        "heading": "viii). Professional Engagement & Public Advocacy",
        "content": "DYNACLEAN INDUSTRIES are encouraged to associate themselves with activities of professional bodies/fora to enrich their knowledge and also help in building organization’s image. The government is an important stakeholder in our business and we therefore engage with it through multiple business forums and trade organizations. We shall engage with the government and regulators in a constructive manner in order to promote good governance. Our senior executives are active members of industry bodies that participate in the development of public policy that addresses issues affecting industry, business, products and customers. However, such engagement should not result in dereliction of duty or in discrediting the organization’s image/reputation or abuse of organization’s resources."
      },
      {
        "id": "company-assets",
        "heading": "ix). Use of Company Assets & Brand Logo",
        "content": "DYNACLEAN INDUSTRIES shall not exploit the organizational resources for one’s own personal gain/pecuniary advantage. In discharge of official duties, one shall strive for effective and judicious use of resources entrusted to them. Resources include both tangible assets like equipment and facilities etc. or intangible assets like designs, information, software or network with suppliers/customers, etc. DYNACLEAN INDUSTRIES are entrusted with the duty of using the brand logo without modifying the same. All the employees shall abide by the guidelines for Brand applications/usages including on visiting cards. Deviations from the specific logo templates will not be permitted."
      },
      {
        "id": "intellectual-property",
        "heading": "x). Intellectual Property",
        "content": "Company’s intellectual property is an invaluable asset that must be protected at all times. DYNACLEAN INDUSTRIES shall respect and protect all confidential information and intellectual property of the Company. DYNACLEAN INDUSTRIES shall safeguard the confidentiality of all third-party intellectual property and data. DYNACLEAN INDUSTRIES shall not misuse such intellectual property and data that comes into their possession and shall not share it with anyone, except in accordance with applicable company policies or law. DYNACLEAN INDUSTRIES shall promptly report the loss, theft or destruction of any intellectual property and data of the Company or that of any third party."
      },
      {
        "id": "social-media",
        "heading": "xi). Social Media Code of Conduct",
        "content": "DYNACLEAN INDUSTRIES encourages social media interaction (during the employees’ personal time) in an individual capacity and we trust our employees to act responsibly adhering to the policies of the company with respect to messages pertaining to the business and/or brand. DYNACLEAN INDUSTRIES are expected to use social media in the best interests of the Company wherever there is any reference to the Company’s name, brand or reputation. Social media interaction includes all digital social platforms and online interaction including interaction on platforms such as LinkedIn/ Facebook / Twitter / YouTube / Snapchat / Blogs or Review platforms / Whatsapp. Responsibility: Every employee is responsible for what they post. They have to be aware that social media interactions for or a behalf of the Company (intended or unintended) can have legal repercussions that make the Company liable. They should not use the DYNACLEAN INDUSTRIES logo or trademarks as their display pictures / images. They should not share information about clients, partners, DYNACLEAN INDUSTRIES leadership, DYNACLEAN INDUSTRIES Businesses and their performance. They should not be involved in Plagiarism or infringement of any copy right, in the context of any reference made about DYNACLEAN INDUSTRIES, its business, products or services. They should avoid anonymous postings. What can be posted on social media: Confidentiality of information should be kept in mind. One may share awards/accomplishments pertaining to the company after they become public information. Personal views and perspectives shared in the form of blogs, articles, stories, narrations any form of postings should have a disclaimer that these views are views of the individual and not of the company. One should not share information on or comment on current or former employees, clients, competitors, vendors or suppliers. One should not share any content that is protected by a third party's copyright. When sharing content created by someone else, due credit should be given to the creator. One should not film or photograph internal events and post them to social media unless one has the authorization from their department head. Tone: One should be Respectful. DYNACLEAN INDUSTRIES does not condone any abuse and trolling on social media. One should use first person (don’t use ‘we’ or ‘us’) when sharing opinions. It should be made clear that what is shared or said, is representative of one’s personal views and opinions only and are not necessarily the views and opinions of DYNACLEAN INDUSTRIES. One should be proactive and take responsibility in accepting and clarifying controversies (if any) around one’s post on social media. DYNACLEAN INDUSTRIES reserves the right to monitor, edit, forbid, stop or / and filter comments or discussions about the group or companies, employees, clients and the industry, including products and competitors, posted by any employee on the Internet / in social media. If any content violates the DYNACLEAN INDUSTRIES Code of Conduct or the social media Policy, or the company’s Communication Policy, the Group reserves the right to seek clarification, and if required, ask the employee to delete that content."
      },
      {
        "id": "information-technology",
        "heading": "xii). Use of Information Technology",
        "content": "DYNACLEAN INDUSTRIES shall judiciously use the Information Technology facilities provided to them. They shall conform to the policy on Information Technology. The increasing usage of E-mails forms a major portion of the network usage. In order to make the best utilization of the resources and to prevent undesirable fallouts resulting from the use of E-mails, users should comply with the Corporate E-mail usage Guidelines. Please see Corporate E-mail usage policy framed for the proper utilization of the facility."
      },
      {
        "id": "working-environment",
        "heading": "xiii). Working Environment & Dress Code Policy",
        "content": "DYNACLEAN INDUSTRIES shall not engage in any activity that is likely to result in disturbing peace & harmony in the workplace or engage in activities that are likely to create tension, bitterness or confusion in the minds of colleagues. Superiors shall endeavor to create a climate in ensuring the above. All DYNACLEAN INDUSTRIES are expected to follow the dress code policy in order to project a professional image through attire and bearing."
      },
      {
        "id": "ehs",
        "heading": "xiv). Environment, Health & Safety (EHS)",
        "content": "Safety is the core component of a Company’s responsibility; it is also the foundation of its long-term viability. Company is committed to the safety and health of employees. Company believes that all injuries and occupational illnesses are preventable. Company has a commitment to zero injuries in the workplace. DYNACLEAN INDUSTRIES shall endeavor to create a safe working environment by following the policies and procedures as laid down in the Corporate Environment, Health & Safety Management Systems framework. Towards this, all the employees shall:\n\n- Incorporate EHS considerations in all business decisions\n- Ensure compliance to statutory and other requirements\n- Prevent adverse environmental impacts and occupational health and safety risks\n- Conserve natural resources, minimize waste generation and environmental emissions\n- Impact structured training for employees and stakeholders for effective EHS performance\n- Encourage communication, consultation and collaboration with all the stakeholders\n\nDYNACLEAN INDUSTRIES shall strive to keep ones’ own place and surrounding workplace clean and hygienic."
      },
      {
        "id": "human-rights",
        "heading": "xv). Respect for Human Rights",
        "content": "The Company respects human rights everywhere it works and while doing business with others. The Company does not employ children at the workplaces. The Company also does not use forced labour in any form."
      },
      {
        "id": "sustainability",
        "heading": "xvi). Sustainability",
        "content": "DYNACLEAN INDUSTRIES is committed to fulfilling our economic, environmental and social responsibilities while conducting business. All the DYNACLEAN INDUSTRIES shall strive to conserve natural resources, and achieve sustainable growth, through a culture of trust and care."
      },
      {
        "id": "corporate-hr-policy",
        "heading": "xvii). Corporate HR Policy",
        "content": "People are the most valuable resources that contribute towards realizing the dynamic vision of the Company. Hence in consonance with the HR functions, we shall be relentlessly committing ourselves to:\n\n- Acquiring, developing and retaining a pool of high-caliber talent\n- Enabling and empowering our employees to be creative and innovative\n- Establishing systems and practices for maintaining transparency, fairness and equality\n- Creating a culture of continuous learning, competitiveness and excellence through change management\n- Respecting ethics, values and good governance\n- Provide equal opportunity for growth & development"
      },
      {
        "id": "risk-management",
        "heading": "xviii). Risk Management Framework Including Tax Risk Management Policy",
        "content": "The employees must comply with all the laws applicable to the Company, adhere to the Risk Management framework and abide by the Internal Control Guidelines including the Tax Risk Management Policy."
      },
      {
        "id": "prohibited-items",
        "heading": "xix). Prohibited Items",
        "content": "Use, sale, purchase or possession of alchohol/narcotic drugs/arms/weapons by DYNACLEAN INDUSTRIES at workplace or when on duty, is prohibited. Smoking is allowed only at designated places."
      },
      {
        "id": "anti-bribery",
        "heading": "xx). Anti-Bribery",
        "content": "DYNACLEAN INDUSTRIES should never offer, directly or indirectly, any form of gift, entertainment or anything of value to any government official or commercial partners including customers or their representatives to:\n\n- Obtain or retain business\n- Influence business decisions; or\n- Secure an unfair advantage.\n\nThis includes bribes, kickbacks and facilitation payments. DYNACLEAN INDUSTRIES should not accept, directly or indirectly, any form of gift, entertainment or anything of conspicuously high value from existing and potential business partners, vendors or their representatives. This includes bribes, kickbacks and facilitation payments. Gifts/Honorarium of nominal value accepted or offered on the occasion of festivals, talks for academic sessions, contribution to academic boards etc. will be permitted, as mentioned in ‘Gift Policy’ below."
      },
      {
        "id": "gift-policy",
        "heading": "xxi). Gift Policy",
        "content": "A gift is anything of value and would encompass any gratuitous monetary or non-monetary benefit. It includes tangible items such as cash, precious metals, stones, jewelry, art and any of their equivalents, but also intangible items such as discounts, services, loans, favours, special privileges, advantages, benefits and rights that are not available to the general public. A “gift” also includes meals, entertainment, hospitality, vacations, trips, use of vacation homes, tickets to sporting or music events, outings, vendor familiarization trips and use of recreational facilities. DYNACLEAN INDUSTRIES are prohibited from offering gifts, hospitality and entertainment or anything else of value, which might influence the decisions of counterparties or Officials in connection with the business of the Company. DYNACLEAN INDUSTRIES are also prohibited from accepting any gifts, hospitality and entertainment, or anything else of value, which might influence their own decisions. Only Gifts/Honorarium of nominal value accepted or offered on the occasion of festivals, talks, etc. will be permitted under this Policy. Such gifts should comply with local laws and customs (including cultural and religious festivals) and should not be prohibited under applicable law and should not include cash or cash equivalents, gold or other precious metals, gems or stones. DYNACLEAN INDUSTRIES - ites may also initiate or become part of occasional business meals or celebratory events and entertainment, etc. in such manner that this policy remains unstained."
      },
      {
        "id": "information-security",
        "heading": "xxii). Information Security",
        "content": "The Information Security Policy sets out the expectations on every employee to safeguard confidential information of the Company and our third parties with the assurance of security, availability, integrity and confidentiality. This policy provides employees with the mandatory directive of safeguarding DYNACLEAN INDUSTRIES and its stakeholder’s information."
      },
      {
        "id": "and-finally",
        "heading": "xxiii) And Finally",
        "content": "All DYNACLEAN INDUSTRIES besides being good employees, shall endeavor to contribute towards: Development of the Community and Society. Supporting National & Humanitarian Causes."
      }
    ]
  },
  "implementationAndMonitoring": {
    "title": "IV. MECHANISM FOR IMPLEMENTATION AND MONITORING",
    "content": "Approvals / Disclosures under the points mentioned above should be as per the respective policies. Violations of the Code of Conduct should be reported as per the Reporting Matrix which is annexed and forms an integral part of the Code of Conduct. As a practice, any violations should be reported to the 1st Level Reporting Authority who shall investigate the same and take necessary action. However, if the violation is by the 1st Level Reporting Authority itself, then it should be reported to the 2nd Level Reporting Authority. In case the Reporting Authority comes to the conclusion that the violation is of a grave nature, the same shall be reported to the Whistleblower Investigation Committee for further action within a reasonable time frame. The concerned Reporting Authority will give a summary of the violations reported of the Code of Conduct and the action taken thereon on a monthly basis to the IC HR Head who in turn shall provide the same to Corporate HR."
  },
  "ecomDisclosure": {
    "title": "V. ECOM DISCLOSURE",
    "content": "Corporate HR Head will provide a summary of the violations reported of the Code of Conduct and the action taken thereon on a quarterly basis."
  },
  "reviewAndAmendment": {
    "title": "VI. REVIEW & AMENDMENT",
    "content": "The Code shall be reviewed as and when required to ensure that it meets the objectives of the relevant legislation and remains effective. The ECOM has the right to change/amend the Code as may be expedient taking into account the law for the time being in force."
  },
  "nonCompliance": {
    "title": "VII. NON-COMPLIANCE",
    "content": "Non-compliance of the provisions of this Code shall be treated as dereliction and an act of misconduct."
  },
  "annexure": {
    "title": "ANNEXURE - MATRIX: AUTHORITIES FOR BREACH REPORTING & CLARIFICATIONS /SEEKING PERMISSIONS Reporting Structure",
    "reportingTable": {
      "headers": ["Sl No", "Breach reporting", "1st Level", "2nd Level", "Remarks"],
      "rows": [
        ["1", "Work Place Conduct (Abusive or offensive language)", "HR", "DH", ""],
        ["2", "Reporting of Bribe/ Fraud", "DH", "", ""],
        ["3", "Breach of Confidentiality/Intellectual Property - sharing trade secrets and confidential information", "DH", "", ""],
        ["4", "Dealing in securities while in possession of UPSI", "DH", "", ""],
        ["5", "Misuse of Company's Assets", "DH", "", ""],
        ["6", "Breach of information security", "DH", "", ""],
        ["7", "Use of prohibited Items like drugs, weapons, etc.", "DH", "", ""],
        ["8", "Sexual Harassment", "DH", "", ""]
      ]
    },
    "clarificationTable": {
      "headers": ["Sl No", "Clarification /Permissions", "Authority"],
      "rows": [
        ["1", "Dealing in securities", "DH"],
        ["2", "Professional Engagement and Public Advocacy", "DH"],
        ["3", "Company Assets & Brand Logo", "DH"],
        ["4", "Social Media Code of Conduct", "DH"],
        ["5", "Information Technology", "DH"],
        ["6", "Work Environment Dress Code Policy", "DH"],
        ["7", "Environment, Health & Safety", "DH"]
      ]
    },
    "legend": {
      "DH": "Department Head",
      "WBI": "Whistle Blower Investigator",
      "ICC": "Internal Complaints Committee",
      "CMBC": "Corporate Brand Management & Communications",
      "CHR": "Corporate Human Resources"
    },
    "escalationInfo": "If not attended to, can be escalated to Director. The Complainant has the option to write directly to the Chairperson of the Audit Committee at ceo@dynacleanindusries.com."
  },
  "acknowledgement": {
    "title": "Form on Acknowledgement and Receipt of Code of Conduct",
    "content": "I, ______________, hereby acknowledge that I have received, read, fully understood the Code of Conduct of Dynaclean Industries. I commit to upholding the principles and standards set forth in the Code of Conduct, recognizing its critical role in guiding my professional conduct. I acknowledge and affirm that I will adhere to the standards, policies, and procedures outlined in the Code of Conduct and understand that compliance is a condition of my continued employment with Dynaclean Industries. I further understand and acknowledge that the Code of Conduct may be supplemented by additional policies, guidelines, or legal requirements specific to my role, function, or jurisdiction in which I work. I agree to familiarize myself with these supplementary requirements and to comply with them fully and diligently. I understand and accept that that failure to comply with the Code of Conduct, its supplementary policies, or any applicable laws or regulations, may result in disciplinary action, up to and including termination of employment. Additionally, I acknowledge that the Company reserves the right to amend or update the Code of Conduct at its discretion, and I commit to keeping myself informed of such updates as they occur. I will proactively seek guidance if I am ever uncertain about my obligations under the Code of Conduct or any legal or regulatory requirements applicable to my role. By signing below, I confirm my commitment to upholding the ethical standards of Dynaclean Industries and to conducting myself with integrity in all aspects of my professional responsibilities.",
    "fields": [
      {"label": "Name", "type": "text"},
      {"label": "Signature", "type": "text"},
      {"label": "Date", "type": "text"}
    ]
  }
}