{
  "title": "Walk Behind Scrubber Drier DYNA-40",
  "images": [
      "/Product/Auto-Scrubber-Drier/DYNA-40/1.png",
      "/Product/Auto-Scrubber-Drier/DYNA-40/2.png",
      "/Product/Auto-Scrubber-Drier/DYNA-40/3.png"
  ],
  "specifications": [
[
  { "label": "Clean Water Tank", "value": "35 L" },
  { "label": "Waste Water Tank ", "value": "40 L" },
  { "label": "Scrubbing Width", "value": "460 mm" },
  { "label": "Squeegee Width", "value": "780 mm" },
  { "label": "Cleaning Efficiency", "value": "1800 m²/h" },
  { "label": "Wire Size", "value": "15 m" },
  { "label": "Voltage", "value": "220 V" }
],[
  { "label": "Brush Motor", "value": "1100 W" },
  { "label": "Suction Motor", "value": "550 W" },
  { "label": "Brush Pressure", "value": "40 Kg" },
  { "label": "Size", "value": "970 x 540 x 970 mm" },
  { "label": "Weight", "value": "95 kg" },
  { "label": "Working Time", "value": "N/A" }
]
  ],
  "youtubeVideoId": "VuwDveivehc",
  "contactLink": "/contact",
  "catalogLink": "/catalogue/walk_scrubber_driers/DYNA-40.pdf",
  "descriptionTitle": "Overview",
  "description": "Dynaclean Industries introduces another auto Scrubber Driers or <a href=\"/products/scrubber-drier/DRO-8085\" target=\"_blank\" style=\"color: #6f73d6; \">Walk Behind Scrubber Driers</a>, the Dyna-40, which is the ideal combination of performance, convenience of use, and technology. Dyna-40 operates on electricity as well as eco-friendly providing flexibility and agility while ensuring efficient cleaning. Scrubber drier increased tank capacity allows for longer, uninterrupted operation. Designed for difficult cleaning applications, this Scrubber machine is ideal for customers seeking a balance of performance, flexibility, with single disc scrubber",
"keyFeatures": [
  "Efficient Cleaning Performance delivers high-speed cleaning of up to 1,800 m²/hour",
  "User-Centric Design ensures comfort by providing easy to use systems such as smooth steering.",
  "High-Capacity Dual Tanks Minimizes the refill and disposal time",
  "Enhanced Productivity with fully electric operated scrubber cleans the floor without interruption",
  "Powerful Cleaning Technology with the suction and brush motors respectively provide scrubbing and drying at the same time",
  "Energy-Efficient Operation Daily performance without need of excessive power consumption",
  "Versatile Applications Operating efficiently in hospitals, gyms, parking/stations.",
  "Integrated with high quality brush and scrubber ensuring dependable functionality."
]




}
