{
  "title": "Escalator Cleaner D-510ES",
  "images": [
   "/Product/Escalator-cleaner/1.png",
   "/Product/Escalator-cleaner/2.png",
   "/Product/Escalator-cleaner/3.png",
   "/Product/Escalator-cleaner/4.png"
  ],
  "specifications": [
[
  { "label": "Clear Water Tank", "value": "32L" },
  { "label": "Waste Dust Tank", "value": "35L" },
  { "label": "Scrubbing Width", "value": "510mm" },
  { "label": "Cleaning Efficiency", "value": "1000 m²/h" },
  { "label": "Voltage", "value": "220V" },
  { "label": "Brush Motor", "value": "1600W" }],[
  { "label": "Suction Motor", "value": "500W" },
  { "label": "Brush Pressure", "value": "30Kg" },
  { "label": "Cable Length", "value": "15m" },
  { "label": "D-510ES Weight", "value": "130Kg" },
  { "label": "Size", "value": "1220x620x980 mm" }
]



  ],
  "youtubeVideoId": "JeLk_81msSo",
  "contactLink": "/contact",
  "catalogLink": "/catalogue/escalator_cleaners/D-510ES.pdf",
  "descriptionTitle": "Overview",
  "description": "This   <a href=\"/products/scooter-mop/DMS-115P\" target=\"_blank\" style=\"color: #6f73d6; \">Escalator Cleaner, D-510Es </a>, is specifically created to keep escalators clean, safe, and running smoothly. Equipped with the most high-end brush and suction that is powerful, the machine effortlessly takes away dirt, dust, and other debris from difficult-to-reach steps and grooves, providing a comfortable ride for all passengers while reducing maintenance downtime.Small and simple to move the D-510Es is small and compact, with easy-to-use controls and a robust construction that can withstand the rigors of the demands of daily commercial usage. Its low-noise operation makes it ideal for shopping malls, crowded airports, metro stations, and commercial complexes where safety and cleanliness are paramount.",
"keyFeatures": [
    "High-Capacity Water Tanks – Comes with large clean and recovery tanks of 32 and 35 Liters, enabling longer cleaning sessions with fewer interruptions.",
    "Dual Brush Cleaning System – Features front and rear rotating brushes that deliver powerful scrubbing action across every step, ensuring complete dirt removal even in grooves and edges.",
    "Cleanse Steps with Targeted Cleaning – Brushes and suction are perfect for escalator steps and grooves.",
    "Highly effective Dust & Cleansing Debris – Keeps escalators free from slip hazards and grime.",
    "Lightweight and Compact – Easy to handle in tight spaces as well as on escalators moving.",
    "Operating at a low-noise level – Reduces noise in commercial and public areas.",
    "Ergonomic Design – Controls that are comfortable for an effortless, smooth operation.",
    "Long-Term Construction – Made for day-to-day commercial use with heavy-duty requirements."
  ]


}
