{
  "title": "Municipal Sweeper Truck DTMS-5000",
  "images": [
      "/Product/Munciple-Deisal-sweeper-Truck/DTMS-1000/1.png",
      "/Product/Munciple-Deisal-sweeper-Truck/DTMS-5000/1.png",
      "/Product/Munciple-Deisal-sweeper-Truck/DTMS-5000/2.png"

  ],
  "specifications": [
[
  { "label": "Chassis", "value": "16 Ton" },
  { "label": "Hopper Capacity", "value": "5 m³" },
  { "label": "Auxiliary Engine", "value": "100 Hp" },
  { "label": "Rotary Brush", "value": "2x 500mm" },
  { "label": "Main Brush", "value": "1900mm" },
  { "label": "Main Brush Dia", "value": "381mm" },
  { "label": "Sweeping Width", "value": "3000mm" }],[
  { "label": "Working Speed", "value": "2.0-15.4 km/h" },
  { "label": "Water Tank", "value": "500L" },
  { "label": "Dust Tank", "value": "26000 m²/h" },
  { "label": "Vacuum Hose", "value": "5m" },
  { "label": "Hose Dia", "value": "150mm" },
  { "label": "High Pressure Jet Washer", "value": "Yes" },
  { "label": "Auxiliary Engine Fuel", "value": "Diesel (Turbo)" },
  { "label": "Recommended Chassis", "value": "TATA ULTRA" }
]






  ],
  "contactLink": "/contact",
  "catalogLink": "/catalogue/municipal_sweeper/DTMS-5000.pdf",
  "descriptionTitle": "Overview",
  "description": "The DTMS-5000 municipal <a href=\"/products/battery-operated-sweeper-truck/DTMS-5000\" target=\"_blank\" style=\"color: #6f73d6; \">Sweeper Truck</a> represents the pinnacle of high-capacity road sweep technology. A powerful diesel engine powers it, it's designed to offer the highest cleaning coverage, outstanding suction power, and constant high-performance for industrial and urban settings. With extra-wide sweeping arms, a high-tech vacuum system with integrated water spray jets, and an enormous waste hopper, the DTMS-5000 provides high efficiency in dust and debris collection using only a few runs. With its comfortable cabin for the operator, an integrated litter picker, as well as an intelligent control panel, the DTMS-5000 provides unbeatable convenience and efficiency. Ideal for big campuses, city roads, and smart city projects, it creates an entirely new standard for street cleaning for municipal roads.",
"keyFeatures": [
  "High-Capacity Water & Dust Tanks – 500L water and 5000L dust collection for extended operation.",
  "Powerful Performance – Best performance in heavy-duty sweeping operations, as it utilizes high torque from the diesel engines.",
  "Long Operating Range – Able to run for several hours continuously without frequent refuels.",
  "Integrated Litter Picker – Enhanced efficiency along edges and corners of curbs for the easy collection of larger forms of litter such as wrappers and bottles.",
  "High Suction Capacity – Efficiently lifts dust, gravel, leaves, and plastic litter from roads.",
  "Large Waste Hopper – Less operational pauses bringing increased efficiency by decreasing the need for frequent unloads.",
  "Strong Water Spraying System – Improves cleaning quality by reducing airborne dust while cleaning.",
  "Tough Conditions Are No Problem – Functions properly in any weather or terrain.",
  "Best For City Use – Best suited for major roads, urban roads, and large industrial cities."
]





}
